<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="blur_image" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,736,1312"/>
			<rt_info>
				<attribute name="fused_names" value="blur_image" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="blur_image" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
					<rt_info>
						<attribute layout="[N,C,H,W]" name="layout" version="0"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_6473" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1, 160, 1, 1" size="640"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_6468" type="Const" version="opset1">
			<data element_type="f32" offset="640" shape="1, 576, 1, 1" size="2304"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_6463" type="Const" version="opset1">
			<data element_type="f32" offset="2944" shape="1, 576, 1, 1" size="2304"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_6428" type="Const" version="opset1">
			<data element_type="f32" offset="5248" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_6423" type="Const" version="opset1">
			<data element_type="f32" offset="5632" shape="1, 384, 1, 1" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_6418" type="Const" version="opset1">
			<data element_type="f32" offset="7168" shape="1, 384, 1, 1" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_6368" type="Const" version="opset1">
			<data element_type="f32" offset="8704" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_6363" type="Const" version="opset1">
			<data element_type="f32" offset="8960" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_6358" type="Const" version="opset1">
			<data element_type="f32" offset="9728" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_6323" type="Const" version="opset1">
			<data element_type="f32" offset="10496" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_6318" type="Const" version="opset1">
			<data element_type="f32" offset="10624" shape="1, 144, 1, 1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_6313" type="Const" version="opset1">
			<data element_type="f32" offset="11200" shape="1, 144, 1, 1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_6293" type="Const" version="opset1">
			<data element_type="f32" offset="11776" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_6288" type="Const" version="opset1">
			<data element_type="f32" offset="11872" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_6283" type="Const" version="opset1">
			<data element_type="f32" offset="12256" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_6278" type="Const" version="opset1">
			<data element_type="f32" offset="12640" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_6273" type="Const" version="opset1">
			<data element_type="f32" offset="12704" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_6268" type="Const" version="opset1">
			<data element_type="f32" offset="12832" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Range_3727" type="Const" version="opset1">
			<data element_type="i32" offset="12960" shape="3" size="12"/>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_3728" type="Const" version="opset1">
			<data element_type="i32" offset="12972" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_3728" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Gather_3729" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" value="Gather_3729, Range_3727" version="0"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_6266" type="Const" version="opset1">
			<data element_type="f32" offset="12976" shape="1, 1, 1, 1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Subtract_3731" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Subtract_3731" version="0"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_6267" type="Const" version="opset1">
			<data element_type="f32" offset="12980" shape="1, 1, 1, 1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Divide_3733" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_3732, Divide_3733" version="0"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="impl.module.fpn.features.0.0.weight" type="Const" version="opset1">
			<data element_type="f32" offset="12984" shape="32, 3, 3, 3" size="3456"/>
			<rt_info>
				<attribute name="fused_names" value="impl.module.fpn.features.0.0.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="impl.module.fpn.features.0.0.weight" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="197" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="197" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="197" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_221" type="Const" version="opset1">
			<data element_type="i64" offset="16440" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_221" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="198" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<rt_info>
				<attribute name="fused_names" value="198" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="198" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_242" type="Const" version="opset1">
			<data element_type="i64" offset="16464" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_242" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="218" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="218" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="218" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_244" type="Const" version="opset1">
			<data element_type="i64" offset="16472" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_244" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="219" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="219" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="219" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="220" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="220" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="220" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="221" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="221" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" names="221" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_6271" type="Const" version="opset1">
			<data element_type="f32" offset="16480" shape="1, 1, 1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_223" type="Const" version="opset1">
			<data element_type="i64" offset="16440" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_223" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="199" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" value="199" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="199" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="200" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="200" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="200" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="201" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="201" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" names="201" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_227" type="Const" version="opset1">
			<data element_type="i64" offset="16440" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_227" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="202" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<rt_info>
				<attribute name="fused_names" value="202" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="202" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="203" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="203" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="203" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_6269" type="Const" version="opset1">
			<data element_type="f32" offset="16484" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="206" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="206" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="206" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_231" type="Const" version="opset1">
			<data element_type="i64" offset="16464" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_231" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="207" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="207" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="207" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_233" type="Const" version="opset1">
			<data element_type="i64" offset="16472" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_233" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="208" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="208" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="208" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_6270" type="Const" version="opset1">
			<data element_type="f32" offset="16488" shape="1, 1, 1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="210" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="210" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="210" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="211" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="211" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="211" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="213" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" value="213, 215" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="213,215" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="222" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="222" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="222" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_6272" type="Const" version="opset1">
			<data element_type="f32" offset="16492" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="225" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="225" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="225" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="228" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="228, Maximum_252" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="1" names="228" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_262" type="Const" version="opset1">
			<data element_type="f32" offset="16620" shape="32, 1, 1, 3, 3" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="229" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="229, Reshape_262" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="229" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_329" type="Const" version="opset1">
			<data element_type="i64" offset="16440" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_329" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="230" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<rt_info>
				<attribute name="fused_names" value="230" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="230" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_350" type="Const" version="opset1">
			<data element_type="i64" offset="16464" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_350" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="250" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="250" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="250" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_352" type="Const" version="opset1">
			<data element_type="i64" offset="16472" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_352" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="251" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="251" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="251" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="252" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="252" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="252" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="253" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="253" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" names="253" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_6276" type="Const" version="opset1">
			<data element_type="f32" offset="16480" shape="1, 1, 1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_331" type="Const" version="opset1">
			<data element_type="i64" offset="16440" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_331" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="231" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" value="231" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="231" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="232" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="232" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="232" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="233" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="233" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" names="233" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_335" type="Const" version="opset1">
			<data element_type="i64" offset="16440" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_335" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="234" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<rt_info>
				<attribute name="fused_names" value="234" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="234" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="235" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="235" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="235" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_6274" type="Const" version="opset1">
			<data element_type="f32" offset="16484" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="238" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="238" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="238" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_339" type="Const" version="opset1">
			<data element_type="i64" offset="16464" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_339" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="239" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="239" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="239" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_341" type="Const" version="opset1">
			<data element_type="i64" offset="16472" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_341" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="240" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="240" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="240" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_6275" type="Const" version="opset1">
			<data element_type="f32" offset="16488" shape="1, 1, 1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="242" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="242" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="242" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="243" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="243" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="243" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="245" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" value="245, 247" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="245,247" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="254" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="254" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="254" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_6277" type="Const" version="opset1">
			<data element_type="f32" offset="17772" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="257" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="257" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="257" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="260" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="260, Maximum_360" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="1" names="260" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="impl.module.fpn.features.1.conv.3.weight" type="Const" version="opset1">
			<data element_type="f32" offset="17900" shape="16, 32, 1, 1" size="2048"/>
			<rt_info>
				<attribute name="fused_names" value="impl.module.fpn.features.1.conv.3.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="impl.module.fpn.features.1.conv.3.weight" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="261" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="261" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="261" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_364" type="Const" version="opset1">
			<data element_type="i64" offset="16440" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_364" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="262" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<rt_info>
				<attribute name="fused_names" value="262" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="262" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_385" type="Const" version="opset1">
			<data element_type="i64" offset="16464" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_385" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="282" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="282" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="282" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_387" type="Const" version="opset1">
			<data element_type="i64" offset="16472" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_387" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="283" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="283" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="283" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="284" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="284" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="284" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="285" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="285" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" names="285" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_6281" type="Const" version="opset1">
			<data element_type="f32" offset="16480" shape="1, 1, 1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_366" type="Const" version="opset1">
			<data element_type="i64" offset="16440" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_366" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="263" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" value="263" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="263" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="264" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="264" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="264" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="265" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="265" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" names="265" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_370" type="Const" version="opset1">
			<data element_type="i64" offset="16440" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_370" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="266" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<rt_info>
				<attribute name="fused_names" value="266" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="266" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="267" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="267" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="267" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_6279" type="Const" version="opset1">
			<data element_type="f32" offset="16484" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="270" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="270" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="270" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_374" type="Const" version="opset1">
			<data element_type="i64" offset="16464" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_374" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="271" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="271" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="271" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_376" type="Const" version="opset1">
			<data element_type="i64" offset="16472" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_376" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="272" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="272" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="272" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_6280" type="Const" version="opset1">
			<data element_type="f32" offset="16488" shape="1, 1, 1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="274" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="274" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="274" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="275" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="275" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="275" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
